<?php 
    // Локализация в OneConnect не полностью доделана, потому что я ленивая жопа

    $lang_name = "Русский (Russian)";

    // head

    $lang_user_head = "Пользователь ";
    $lang_wall_head = "Стена";

    //Header

    $lang_login = "|Войти|";
    $lang_register = "|Регистрироваться|";

    $lang_logout = "|Выйти|";
    $lang_search = "|Пользователь|";
    $lang_search_user = "Поиск Пользователей";
    $lang_profile = "|Профиль|";
    $lang_wall = "Стена";
    $lang_mgames = "|Mayner Игры|";
    $lang_profile = "|Профиль|";
    $lang_home = "|Главная|";

    // Body

    $lang_welcome = "
        <h1>Добро пожаловать на $sitename!</h1>
        <p>Вы На Сайте Разроботчика matveymayner поздровляю</p>
        <p>Тут Можно общяться с людьми, и также, СКАЧИВАТЬ ИГРЫ!</p>
        <p>от самого разраба сайта ;)</p>
        <p>И также соблюдайте правила на этом сайте</p>
        <p>ㅤ</p>
        <p>ㅤ</p>
        <p>ㅤ</p>
        <p>ㅤ</p>
        <p>ㅤ</p>
        <p>ㅤ</p>
        <p>ㅤ</p>
        <p>ㅤ</p>
        <p>ㅤ</p>
        <p>ㅤ</p>
        <p>Тут Можно Скачать любую игру от этого разработчика</p>
        <p>Batch Down</p>
    ";
    $lang_rules = "
        <h3>Пользовательское соглашение на $sitename:</h3>
<p></p>
Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между владельцем mayner-net.42web.io (далее Mayner Net или Администрация) с одной стороны и пользователем сайта с другой.
Сайт Mayner Net не является средством массовой информации.

Используя сайт, Вы соглашаетесь с условиями данного соглашения.
<h3>Если Вы не согласны с условиями данного соглашения, не используйте сайт Mayner Net!</h3>

<h3>Предмет соглашения</h3>
<h3>Администрация предоставляет пользователю право на размещение на сайте следующей информации:</h3>

Предмет соглашения
Администрация предоставляет пользователю право на размещение на сайте следующей информации:
- Текстовой информации
- Ссылок на материалы, размещенные на других сайтах

Права и обязанности сторон
Пользователь имеет право:
- осуществлять поиск информации на сайте
- получать информацию на сайте
- создавать информацию для сайта
- комментировать контент, выложенный на сайте
- копировать информацию на другие сайты с указанием источника
- использовать информацию сайта в личных некоммерческих целях

Администрация имеет право:
- по своему усмотрению и необходимости создавать, изменять, отменять правила
- ограничивать доступ к любой информации на сайте
- создавать, изменять, удалять информацию
- удалять учетные записи

Пользователь обязуется:
- не распространять информацию, которая направлена на пропаганду войны, разжигание национальной, расовой или религиозной ненависти и вражды, а также иной информации, за распространение которой предусмотрена уголовная или административная ответственность
- не нарушать работоспособность сайта
- не совершать действия, направленные на введение других Пользователей в заблуждение
- не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами

Администрация обязуется:
- поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.

Ответственность сторон
- администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами
- в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса

Условия действия Соглашения
Данное Соглашение вступает в силу при регистрации на сайте.
Соглашение перестает действовать при появлении его новой версии.
Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.
При любом изменении данного соглашения, администрация будет оповещать пользователей удобным для нее способом.


Соглашение разработано на базе юридических документов сервиса Правилль<br>
        </p>
        <h3>Так же Мы получаем такие данные как: IP адрес (Для бана по IP), Email и все данные которые вы ввели в регистрации из Mayner Net.</h3>
    ";
    $lang_authors1 = "Сам OneConnect написан одним человеком с использованием идей других людей из телеграмм канала БлопСофта, сам человек это:";
    $lang_authors2 = "В $sitename модераторами являются:";
    $lang_authors3 = "Сам OneConnect использует лицензию BSD 3-Clause и если вы хотите форкнуть OneConnect то вы должны указать авторство оригинального продукта, закрывать исходники своего форка OneConnect можно.";

    $lang_nickname = "Имя: ";
    $lang_yespost = "Разрешить писать на моей стене:";
    $lang_langnt = "Язык интерфейса:";
    $lang_change = "Изменить";
    $lang_changepass = "Изменить пароль";

    $lang_find = "Найдено: ";
    $lang_find_users = " пользователей";
    $lang_admin = "Админ панель";
    $lang_change_avatar = "Изменить аватарку";
    $lang_settings = "Настройки";
    $lang_description = "Описание: ";

    $lang_yes = "Можно";
    $lang_no = "Нельзя";
$lang_main_rules1 = "1.1 - запрещено оскорбление администрации";
$lang_main_rules2 = "1.2 - Запрещено оскорбление пользователей сайта";
$lang_main_rules3 = " 2.1 - Запрещено Нарушать Работу сайта";
$lang_main_rules4 = "2.3 - Если у вас 3 забаниных аккаунтов мы вас забаним по IP навсегда!";
$lang_main_rules5 = "2.4 - Запрешено Материться на сайте";
$lang_main_rules6 = "3.1 - Если Вы Хотите Удалить Ваш Аккаунт попросите об этом в стене";
$lang_main_rules7 = "3.2 - соблюдать правила и прочитать пользовательское соглашение";
$lang_main_rules8 = "4.1 - НЕ использовать сайт в комерческих целях - либо в целях продвижения";
$lang_main_rules9 = "4.2 - не спамить в стене";
$lang_main_rules10 = "5.1 -  Не Публикуйте не законый контент в вашей стране!";
$lang_main_rules11 = "5.2 - Соблюдать Пользовательское соглашение";
$lang_main_rules12 = "6.1 - проворачивание не законых действий которые противоречят законам вашей страны";
$lang_main_rules13 = "6.2 - Не призывать людей к не законым действиям";
$lang_main_rules14 = "6.3 - Не пропагондировать что либо";
$lang_main_rules15 = "7.1 - Не использовать админ способности в корысных целях (не чего не будет кроме снятия с должности администратора)";
$lang_main_rules16 = "7.2 - Выполнять должность администратора (есть риск блокировки но он очень мал";
$lang_main_rules17 = "7.3 - не знание правил не освобождает вас от блокировки!!!";
$lang_main_rules18 = "8.1 - Спам аккаунтами запрещён после удаления аккаунтов последует бан!";
$lang_main_rules19 = "8.2 - Не делать ники которые будут вводить администраторов в заблуждения, и не престойные ники";
$lang_main_rules20 = "8.3 - Не выкладывать Контент В Котором есть не пристойное содержание караеться удалением постом и баном аккунта при повторе бан по IP";
$lang_main_rules21 = "8.4 - При Взломе или не санкционировоного удалления чего либо караеться баном по IP и просто классическим банном!";
$lang_main_rules22 = "8.5 - Обход бана по IP запрещён";
$lang_main_rules23 = "8.6 - Запрешено копировать посты себе на страницу";
$lang_main_rules24 = "8.7 - Запрешено Копировать Сайт Полностю или чтото авторское!";
$lang_rules_sogl = "Не знание правил не освобождает от ответствиности";

    
    $lang_publish = "Опубликовать";
    $lang_attach = "Прикрепить";
    $lang_image = "Картинка:";
    $lang_pinned = "Закреплено";
    $lang_date = "d M Y в H:i";
    $lang_byname = "От имени: ";
    $lang_nowall = "Пользователь ничего не публиковал на стену...";
    $lang_previous = "Предыдущая страница";
    $lang_next = "Следующая страница";

    // Footer

    $lang_terms = 'Пользовательское соглашение';
    $lang_rulees = 'Правила';
    $lang_authors = 'Авторы';
?>